#!/usr/bin/env python3
# -*- coding:utf-8 -*-

#other

handleSourceOtherDICT = {"weather":["weather","天氣","大太陽","颳風","下雨","毛毛雨","暴雨","午後雷陣雨","打雷","陰陰的","霧霾","濕氣","酷熱","熱","冷","空氣","空氣品質"],
                    "poor":["poor","錢","薪水","薪資","收入","皮包","皮夾","錢包","帳單","信用卡費","信用卡","電費","水費","電話費","通話費"],
                    "noSavings":["noSavings","存錢","存款","儲蓄","月光","月光族","帳戶","戶頭"],
                    "loseMoney":["loseMoney","投資","股票","基金","比特幣"],
                    "food":["food","食物","料理","東西","餐","難吃"],
                    "receipt":["receipt","發票","統一發票","收據","兌獎","對獎","中獎"],
                    "ticket":["ticket","票","門票","入場卷","入場券","買票","搶票","換票"],
                    "thesis":["thesis","論文","寫論文","碩士論文","博士論文","碩論","博論","研究","實驗","受試者","口考","口試","大綱","大綱口試","書","文章"],
                    "sthBroken":["broken","壞掉","破掉","碎掉","裂掉","壞了","破了","碎了","裂了","丟了","不見","弄丟"],
                    "school":["school","上課","課","廢課","爛課","軍訓","服務學習","實驗課","通識","概論","導論","實務","早八","早八的課"],
                    "internship":["internship","實習","見習"],
                    "shop":["shop","店","商店","商品","單品","購物","買","採購","周年慶","特價","買一送一","貴","出清","促銷","特賣"],
                    "exchange":["exchange","交換","交換學生","交換申請","申請交換","留學","遊學"],
                    "score":["score","分數","成績","表現","考","考試","評量","模擬考","學測","指考","會考","托福","雅思","多益","學科","證照","低分","差","不及格","不理想","差強人意","失望","失足"],
                    "missOpportunity":["missOpportunity","機會","時機","機緣","錯過","錯失"],
                    "fateEnd":["fateEnd","緣份","緣分","緣","機緣","姻緣"],
                    "notOpen":["notOpen"],
                    "notDone":["notDone","事","事情","作業","功課","工作","拖延","進度","進步","進展","計畫"],
                    "boringWork":["boringWork","無聊"],
                    "stepInPoop":["stepInPoop","大便","狗屎","屎","糞"],
                    "whatToDo":["whatToDo","如何是好","徬徨","沒有方向","該如何是好","該怎麼辦","要怎麼辦","該怎麼做","要怎麼做","可以怎麼做","應該怎麼做","無助","不知所措"]
                    }


sourceReactionOtherDICT = {"weather":["♪其實我，不是因為好天氣才這麼說，牽著你走過大雨盛開水花的路口，也是我一樣喜歡的夢♪","因為天氣好，因為天氣不好，因為天氣剛剛好，每一天都很美好。","有時我會聽聽雨的聲音，嘈雜中帶點規律，聽著這規律的節拍，心好像也慢慢平靜下來。"],
                      "poor":["好巧，我也覺得錢錢沒有夠用的一天呢！","我知道沒錢的難受，幫你QQ","雖然錢變成了你想要的形狀，但是那是不可逆的魔法，下次消費前不如先問問自己是不是真的需要花這筆錢吧！"],
                      "noSavings":["你聽過財務管理的631法則嗎？將薪水分成60%生活費、30%儲蓄、10%備用或投資，推薦你試試看！"],
                      "loseMoney":["投資一定有風險，但風水輪流轉，一定會再賺回來的！不要灰心～"],
                      "food":["如果你吐出來了！Good Job! 如果沒有，沒關係，這樣不好吃的東西會用另外一種形式排出體外！","吃到可怕的東西的感覺真的很糟啊！我完全可以理解！","天啊！快快去吃你喜歡的東西來平衡一下！(我推薦水果，我最喜歡吃了～)"],
                      "receipt":["換個角度想，你的壞運氣都用在這裡了，接下來都會好運的。","沒關係，至少你是個監督商家有沒有乖乖繳稅的好公民啊！"],
                      "ticket":["有時候運氣也是實力的一種，下次組一支搶票小隊幫忙吧！","可以問問有沒有人想讓票或換票，但切記不要跟黃牛買喔！"],
                      "thesis":["按照自己的步調來，穩穩地走！","每個人都有自己的路和步調，沒有所謂最正確或最快速，只有最適合自己的那種。","辛苦了，論文真的很需要時間。是不是可以和學長姐或是老師討論看看，或是跟朋友聊聊呢？"],
                      "sthBroken":["舊的不去，新的不來，雖然和舊的物品說再見很難過，但是也會迎接新的夥伴啊！", "別難過！相信你可以找到解決方案的！"],
                      "school":["枯燥乏味之事存在的意義有兩個，一個是凸顯其他有趣的事，另一個是讓你從重複中變成大師。","學校不是唯一可以學習的地方，試著自學一些東西，你會發現其中的樂趣。","學校有時候可能會帶給你一些不開心的心情，辛苦了，先轉換心情，釐清一下自己喜歡什麼吧～～"],
                      "internship":["不管實習過程是酸甜苦辣，我相信都一定會學到東西的！！"],
                      "shop":["或許現在不是一個好的時機啊！等時機對了，一定會買到的！","這次只好先守住錢錢，下次再貢獻台灣的GDP了。"],
                      "exchange":["先把結果交給老天吧！我相信你一定為了出國付出了很多努力，相信老天一定會為你預備最好的結果的。","你很優秀又這麼努力，相信幸運之神會站在你這邊的！"],
                      "score":["我相信你一定做了很多的努力，辛苦你了，但我相信你這邊做的努力不會白費，一定可以成為未來很好的養分。", "如果你已經盡力了，那就不愧對自己了。","在不久的將來，你會明白分數並不是一切，只是數字海中的幾個字符而已～"],
                      "missOpportunity":["沒關係，如果它是屬於你的，就會是你的，總有一天會得到它的。","機會是留給準備好的人，錯過了沒關係，相信努力又有實力的你，絕對可以把握住下一次！","我相信你一定可以把握下一次的機會！所以休息一下，就把這次的經驗當成學習機會！","我理解你現在的心情，應該是很不甘心吧！辛苦了，先好好休息，我想信你一定可以把這次的經驗轉化成你的動力！"],
                      "fateEnd":["沒有緣分也沒關係啊！緣分這種東西是勉強不來的～","你現在一定有滿滿的失落感吧！但我們難過一分鐘就好，因為只要跟你有緣，時機到了你一定會遇到的。"],
                      "notOpen":["好可惜喔！但說不定明天你來，他就會開了！","雖然想要的東西沒有買到，但或許身旁也有別的好東西，等你留意哦 :D","我完全可以理解這種期待落空的感覺！真的很讓人不爽！"],
                      "notDone":["親愛的，不要慌～我們一點一點做，絕對可以完成的。","我也很討厭事情做不完的感覺，因為這樣壓力很大啊！但我想和你說，我相信你的能力，按部就班，絕對可以做完的！","有完成壓力真的很不好受，但是也要記得適度休息喔！現在就先喝一口水吧！", "來～先深深吸一口氣～跟自己說一聲「你可以做到的！」","還好嗎？是不是最近壓力太大了？人生很長，不妨讓身體好好休息一番，再重新出發吧！加油加油！","別把自己逼得太緊，適時地放鬆，效果會更好喔。"],
                      "boringWork":["不妨把枯燥乏味的事情看作遊戲，當成一個個任務來破解，這樣就會有趣許多喔。","工作總是會有無聊或是不喜歡的時候，覺得工作起來很無力的話，不妨休息一下，為自己泡杯茶，轉換一下心情永遠是個好方法！","工作難免會有這些比較繁瑣、無趣的時刻，但我相信厲害的你，一定能從中找到樂趣的！"],
                      "stepInPoop":["天啊，可以去買張樂透了！"],
                      "whatToDo":["親愛的，別擔心，靜下心來觀察，你會找到方法的！"],
                      "others":["我知道這很難受，加油！我與你同在","辛苦你了！經歷這一切一定讓你很心累...我與你同在"] #新增萬用
                      }