#seriousSituation: suicide, harassment, domestic violence 
sourceReactionDICT = {"harassment":["sexualHarassment","性騷擾","毛手毛腳","開黃腔","傳裸照","偷拍","捏屁股","摸屁股","摸胸部","摸腿","摟腰","勾肩"
                                    ,"摳手心"],
                      "suicide":["suicide","自殺","消失","不想活","結束生命","用我的命換","永遠都不要醒","活著還有什麼意義","跳樓","跳海","上吊",
                                 "割腕","燒炭","臥軌","輕生"],
                      "domesticViolence":["domestic_violence"]}

sourceReactionDICT = {"harassment":["這邊提供你個連結，如果有需要可以參考看看。【法律小常識】性騷擾，怎麼辦？ http://womany.net/read/article/1777",
                                    "別怕拒絕別人，勇於說不，你可以打這個專線，讓專業的人為你服務: 勵馨基金會 (02)8911-8595","只要有不舒服的感受，要義正嚴詞的說不，讓對方知道事情的嚴重性! 【法律小常識】性騷擾，怎麼辦？http://womany.net/read/article/1777",
                                    "當下很錯愕但又不知道怎麼辦，這裡有個連結給你參考，自己的權益自己維護! 衛服部保護司性騷擾防治法令規章 https://dep.mohw.gov.tw/DOPS/lp-1287-105-xCat-item005.html"],
                      "suicide":["親愛的，你一點都不孤單!想聊聊天、吐苦水的話，我一直都在! \n或是你可以打這支電話，有專人傾聽你的煩惱。\n衛福部24小時安心專線：1925","你會願意和我聊聊嗎? 那怕是一點點也好，或許我能幫忙。\n或是你可以打這支電話，張老師專線：1980","或許你想逃離的不是世界，而是這一切複雜難解的問題和痛苦。如果你願意的話，說說好嗎? 讓大家陪你一起梳理打結的思緒。\n台北市生命線24小時協談專線：02-2505-9595","老天爺關了你一扇門，一定會幫你開另一扇窗!雖然現在很痛苦，你所失去的，一定會在其他地方得到饋贈。 只要我們保持樂觀的心態，相信有失必有得，一定還是有一線生機的。\n如果你需要找人聊聊，可以打這支專線。\n衛福部24小時安心專線：1925","生老病死是人生中的一大課題，我也還在努力學習中。\n如果有需要，全台各地生命線：1995，提供給你參考。"],
                      
                      "domesticViolence":["家暴只有零次和無數次，提供你發生家暴時可以做的6個步驟：(一)、安全第㇐，儘快離開現場。(二)、打 110或113報警或救助。(三)、到醫院驗傷並開立診斷書。(四)、向法院聲請保護令，確保自身安全。(五)、對暴力現場或施虐行為進行拍照存證，但應以安全優先考量。(六)、尋求法律協助，確保自身應有權益。","不管是你最親的家人或是你最愛的伴侶，只要打人罵人就是不對，千萬別心軟再給對方機會，好好保護自己才是最重要的。若有需要，請聯繫各直轄市、縣(市)政府家庭暴力及性侵害防治中心: http://bit.ly/help-for-DV他們會很樂意幫忙你。","如果你正面臨家庭暴力，這裡有個線上通報平台提供你參考，希望對你有幫助。關懷E起來:http://bit.ly/care-about-you","無論是動手或是精神上的暴力都是需要被制止的!請盡可能的蒐證，包含人證、錄音、精神門診的診斷書，希望你可以盡快擺脫施暴者的威脅。你可以看看這個網頁，以尋求專業且免費的諮詢。安心免費法律諮詢:http://bit.ly/law-free"]}
                      